rainrainrainbow/xiaomiao-os/sdkconfig.defaults
# ==================== 小喵 OS 板级默认配置 ====================
# 适用于 ESP32-WROVER-B (4MB Flash / 8MB PSRAM) + ST7735 160x128

# === 芯片 ===
CONFIG_IDF_TARGET="esp32"
CONFIG_ESP32_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32_DEFAULT_CPU_FREQ_MHZ=240

# === Flash / PSRAM ===
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_SPI_FLASH_SIZE=4
CONFIG_ESP32_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_NOINIT_SEG_EXTERNAL_MEMORY=y

# === 优化 ===
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_TIMER_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# === 日志（精简节省 Flash） ===
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_BOOTLOADER_LOG_LEVEL=2
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT=y

# === 文件系统 ===
CONFIG_FATFS_CODEPAGE_437=y
CONFIG_FATFS_LONG_FILENAMES=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_LFN_STACK_BUFFER=y

# === LVGL 配置 ===
# LVGL 9.5 在 ESP-IDF 下使用 esp.cmake 第 74 行的 LV_CONF_INCLUDE_SIMPLE
# 模式, 会在 ${LVGL_ROOT_DIR} 下查找 lv_conf.h. 由 main/CMakeLists.txt
# 在 configure 阶段把 main/lvgl_conf.h 复制过去, 不需要 Kconfig 注入.
# 所有 LV_FONT_MONTSERRAT_X 开关在 main/lvgl_conf.h 里 #define 1.

# === GCC 警告 ===
CONFIG_COMPILER_WARN_WRITE_STRINGS=y

# === 小喵 OS 自定义开关 ===
# 默认关闭 MicroPython（编译快, 桌面仍可显示, App 走 stub）
# 想真跑 .app 时改为 y, 必须在 idf_component.yml 也启用 micropython
CONFIG_ENABLE_MICROPYTHON=n
